const foodAzkar = [
  {
    id: 1,
    count: 1,
    text: "بِسْمِ اللَّهِ.",
    benefit:
      "التسمية قبل الطعام سبب للبركة وتمنع الشيطان من مشاركة الإنسان في طعامه."
  },
  {
    id: 2,
    count: 1,
    text: "بِسْمِ اللَّهِ أَوَّلَهُ وَآخِرَهُ.",
    benefit:
      "يقال إذا نسي المسلم التسمية في أول الطعام."
  },
  {
    id: 3,
    count: 1,
    text: "الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنِي هَذَا، وَرَزَقَنِيهِ، مِنْ غَيْرِ حَوْلٍ مِنِّي وَلَا قُوَّةٍ.",
    benefit:
      "من قاله بعد الطعام غفر له ما تقدم من ذنبه."
  },
  {
    id: 4,
    count: 1,
    text: "الْحَمْدُ لِلَّهِ حَمْدًا كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ، غَيْرَ مَكْفِيٍّ، وَلَا مُوَدَّعٍ، وَلَا مُسْتَغْنًى عَنْهُ رَبَّنَا.",
    benefit:
      "من السنة حمد الله بعد الفراغ من الطعام وشكره على نعمه."
  },{
    id: 5,
    count: 1,
    text: "إِذَا أَكَلَ أَحَدُكُمْ طَعَامًا فَلْيَقُلْ: بِسْمِ اللَّهِ، فَإِنْ نَسِيَ فِي أَوَّلِهِ فَلْيَقُلْ: بِسْمِ اللَّهِ أَوَّلَهُ وَآخِرَهُ.",
    benefit:
      "تعليم نبوي للتسمية قبل الطعام، وما يقال عند نسيانها."
  },
  {
    id: 6,
    count: 1,
    text: "اللَّهُمَّ بَارِكْ لَنَا فِيهِ، وَأَطْعِمْنَا خَيْرًا مِنْهُ.",
    benefit:
      "يقال عند شرب اللبن، ويسأل المسلم فيه البركة والخير."
  },
  {
    id: 7,
    count: 1,
    text: "اللَّهُمَّ بَارِكْ لَنَا فِيمَا رَزَقْتَنَا، وَقِنَا عَذَابَ النَّارِ.",
    benefit:
      "دعاء جميل لشكر الله على الرزق وسؤاله البركة والنجاة من النار."
  }
];

export default foodAzkar;