const homeAzkar = [
  {
    id: 1,
    count: 1,
    text: "بِسْمِ اللَّهِ، تَوَكَّلْتُ عَلَى اللَّهِ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ.",
    benefit:
      "يقال عند الخروج من المنزل، فيُكفى العبد ويُهدى ويُوقى بإذن الله."
  },
  {
    id: 2,
    count: 1,
    text: "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ أَنْ أَضِلَّ أَوْ أُضَلَّ، أَوْ أَزِلَّ أَوْ أُزَلَّ، أَوْ أَظْلِمَ أَوْ أُظْلَمَ، أَوْ أَجْهَلَ أَوْ يُجْهَلَ عَلَيَّ.",
    benefit:
      "دعاء جامع للاستعاذة بالله من الضلال والظلم والجهل عند الخروج."
  },
  {
    id: 3,
    count: 1,
    text: "بِسْمِ اللَّهِ وَلَجْنَا، وَبِسْمِ اللَّهِ خَرَجْنَا، وَعَلَى رَبِّنَا تَوَكَّلْنَا.",
    benefit:
      "يقال عند دخول المنزل، وفيه استعانة بالله وطلب البركة."
  },{
    id: 4,
    count: 1,
    text: "اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ الْمَوْلِجِ وَخَيْرَ الْمَخْرَجِ، بِسْمِ اللَّهِ وَلَجْنَا، وَبِسْمِ اللَّهِ خَرَجْنَا، وَعَلَى اللَّهِ رَبِّنَا تَوَكَّلْنَا.",
    benefit:
      "دعاء يجمع سؤال الله الخير عند الدخول والخروج والتوكل عليه."
  },
  {
    id: 5,
    count: 1,
    text: "السَّلَامُ عَلَيْكُمْ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ.",
    benefit:
      "إلقاء السلام عند دخول المنزل سبب لنيل البركة ونشر المودة بين أهل البيت."
  }
];

export default homeAzkar;