const sleepAzkar = [
  {
    id: 1,
    count: 1,
    text: "بِاسْمِكَ رَبِّـي وَضَعْتُ جَنْبِي، وَبِكَ أَرْفَعُهُ، إِنْ أَمْسَكْتَ نَفْسِي فَارْحَمْهَا، وَإِنْ أَرْسَلْتَهَا فَاحْفَظْهَا بِمَا تَحْفَظُ بِهِ عِبَادَكَ الصَّالِحِينَ.",
    benefit:
      "دعاء عظيم يفوض فيه المسلم نفسه إلى الله قبل النوم ويطلب حفظه ورحمته."
  },
  {
    id: 2,
    count: 1,
    text: "اللَّهُمَّ بِاسْمِكَ أَمُوتُ وَأَحْيَا.",
    benefit:
      "يذكر المسلم بأن حياته وموته بيد الله سبحانه."
  },
  {
    id: 3,
    count: 33,
    text: "سُبْحَانَ اللَّهِ.",
    benefit:
      "التسبيح قبل النوم من السنن العظيمة ويبعث الطمأنينة في القلب."
  },
  {
    id: 4,
    count: 33,
    text: "الْحَمْدُ لِلَّهِ.",
    benefit:
      "الحمد لله على نعمه كلها قبل النوم."
  },
  {
    id: 5,
    count: 34,
    text: "اللَّهُ أَكْبَرُ.",
    benefit:
      "تكبير الله قبل النوم من السنة، وهو خير من الخادم كما أخبر النبي ﷺ."
  },{
    id: 6,
    count: 1,
    text: "اللَّهُمَّ قِنِي عَذَابَكَ يَوْمَ تَبْعَثُ عِبَادَكَ.",
    benefit:
      "كان النبي ﷺ يقول هذا الدعاء عند النوم، وفيه سؤال النجاة من عذاب الله."
  },
  {
    id: 7,
    count: 3,
    text: "اللَّهُمَّ رَبَّ السَّمَاوَاتِ السَّبْعِ وَرَبَّ الْعَرْشِ الْعَظِيمِ، رَبَّنَا وَرَبَّ كُلِّ شَيْءٍ، فَالِقَ الْحَبِّ وَالنَّوَى، وَمُنْزِلَ التَّوْرَاةِ وَالْإِنْجِيلِ وَالْفُرْقَانِ، أَعُوذُ بِكَ مِنْ شَرِّ كُلِّ شَيْءٍ أَنْتَ آخِذٌ بِنَاصِيَتِهِ، اللَّهُمَّ أَنْتَ الْأَوَّلُ فَلَيْسَ قَبْلَكَ شَيْءٌ، وَأَنْتَ الْآخِرُ فَلَيْسَ بَعْدَكَ شَيْءٌ، وَأَنْتَ الظَّاهِرُ فَلَيْسَ فَوْقَكَ شَيْءٌ، وَأَنْتَ الْبَاطِنُ فَلَيْسَ دُونَكَ شَيْءٌ، اقْضِ عَنَّا الدَّيْنَ، وَأَغْنِنَا مِنَ الْفَقْرِ.",
    benefit:
      "دعاء جامع للاستعاذة بالله وسؤاله الغنى وقضاء الدين."
  },
  {
    id: 8,
    count: 1,
    text: "اللَّهُمَّ إِنَّكَ خَلَقْتَ نَفْسِي، وَأَنْتَ تَوَفَّاهَا، لَكَ مَمَاتُهَا وَمَحْيَاهَا، إِنْ أَحْيَيْتَهَا فَاحْفَظْهَا، وَإِنْ أَمَتَّهَا فَاغْفِرْ لَهَا، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَافِيَةَ.",
    benefit:
      "فيه تفويض النفس لله وسؤال الحفظ والمغفرة والعافية."
  },
  {
    id: 9,
    count: 1,
    text: "اجْمَعْ كَفَّيْكَ، ثُمَّ انْفُثْ فِيهِمَا، وَاقْرَأْ: قُلْ هُوَ اللَّهُ أَحَدٌ، وَقُلْ أَعُوذُ بِرَبِّ الْفَلَقِ، وَقُلْ أَعُوذُ بِرَبِّ النَّاسِ، ثُمَّ امْسَحْ بِهِمَا مَا اسْتَطَعْتَ مِنْ جَسَدِكَ، وَافْعَلْ ذَلِكَ ثَلَاثَ مَرَّاتٍ.",
    benefit:
      "من السنة قبل النوم قراءة المعوذات والنفث والمسح على الجسد للحفظ."
  },{
    id: 10,
    count: 1,
    text: "اللَّهُمَّ أَسْلَمْتُ نَفْسِي إِلَيْكَ، وَفَوَّضْتُ أَمْرِي إِلَيْكَ، وَأَلْجَأْتُ ظَهْرِي إِلَيْكَ، رَغْبَةً وَرَهْبَةً إِلَيْكَ، لَا مَلْجَأَ وَلَا مَنْجَا مِنْكَ إِلَّا إِلَيْكَ، آمَنْتُ بِكِتَابِكَ الَّذِي أَنْزَلْتَ، وَبِنَبِيِّكَ الَّذِي أَرْسَلْتَ.",
    benefit:
      "من قاله ثم مات ليلته مات على الفطرة، وهو من أعظم أذكار النوم."
  },
  {
    id: 11,
    count: 1,
    text: "بِاسْمِكَ اللَّهُمَّ أَمُوتُ وَأَحْيَا.",
    benefit:
      "ذكر يذكر المسلم بأن حياته وموته بيد الله سبحانه وتعالى."
  }
];

export default sleepAzkar;