const travelAzkar = [
  {
    id: 1,
    count: 1,
    text: "اللَّهُ أَكْبَرُ، اللَّهُ أَكْبَرُ، اللَّهُ أَكْبَرُ، سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ، وَإِنَّا إِلَى رَبِّنَا لَمُنقَلِبُونَ. اللَّهُمَّ إِنَّا نَسْأَلُكَ فِي سَفَرِنَا هَذَا الْبِرَّ وَالتَّقْوَى، وَمِنَ الْعَمَلِ مَا تَرْضَى، اللَّهُمَّ هَوِّنْ عَلَيْنَا سَفَرَنَا هَذَا، وَاطْوِ عَنَّا بُعْدَهُ، اللَّهُمَّ أَنْتَ الصَّاحِبُ فِي السَّفَرِ، وَالْخَلِيفَةُ فِي الْأَهْلِ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ وَعْثَاءِ السَّفَرِ، وَكَآبَةِ الْمَنْظَرِ، وَسُوءِ الْمُنْقَلَبِ فِي الْمَالِ وَالْأَهْلِ.",
    benefit:
      "دعاء السفر يجمع سؤال الله التوفيق والحفظ وتيسير الطريق والرجوع سالمًا."
  },
  {
    id: 2,
    count: 3,
    text: "اللَّهُ أَكْبَرُ.",
    benefit:
      "من السنة التكبير ثلاث مرات عند الركوب وبدء السفر."
  },
  {
    id: 3,
    count: 1,
    text: "اللَّهُمَّ أَنْتَ الصَّاحِبُ فِي السَّفَرِ، وَالْخَلِيفَةُ فِي الْأَهْلِ.",
    benefit:
      "فيه طلب معية الله وحفظه للمسافر وأهله."
  },
  {
    id: 4,
    count: 1,
    text: "اللَّهُمَّ هَوِّنْ عَلَيْنَا سَفَرَنَا هَذَا، وَاطْوِ عَنَّا بُعْدَهُ.",
    benefit:
      "دعاء لتيسير السفر وتخفيف مشقته."
  },{
    id: 5,
    count: 1,
    text: "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ وَعْثَاءِ السَّفَرِ، وَكَآبَةِ الْمَنْظَرِ، وَسُوءِ الْمُنْقَلَبِ فِي الْمَالِ وَالْأَهْلِ.",
    benefit:
      "دعاء للاستعاذة من مشقة السفر ومن كل ما يسوء المسافر في نفسه أو أهله أو ماله."
  },
  {
    id: 6,
    count: 1,
    text: "آيِبُونَ، تَائِبُونَ، عَابِدُونَ، لِرَبِّنَا حَامِدُونَ.",
    benefit:
      "يقال عند الرجوع من السفر، وفيه شكر الله على السلامة والعودة."
  },
  {
    id: 7,
    count: 1,
    text: "اللَّهُمَّ اجْعَلْ هَذَا السَّفَرَ سَفَرًا مَيْسُورًا، وَارْزُقْنَا فِيهِ الْخَيْرَ وَالْبَرَكَةَ.",
    benefit:
      "دعاء بحسن التوفيق وتيسير أمور السفر والبركة فيه."
  }
];

export default travelAzkar;